Tekla.Structures.ModelInternal.ComponentWrapper
Wraps the Tekla.Structures.Model.Component class.

Tekla.Structures.ModelInternal.ComponentWrapper.component
The component.

Tekla.Structures.ModelInternal.ComponentWrapper.#ctor(Tekla.Structures.Model.Component)
Initializes a new instance of the Tekla.Structures.ModelInternal.ComponentWrapper class.
component: The component.

Tekla.Structures.ModelInternal.ComponentWrapper.Insert
Inserts the component.

Tekla.Structures.ModelInternal.ComponentWrapper.GetStringAttribute(System.String)
Gets the string attribute value for the specified attribute name.
attributeName: The attribute name.
Returns: The string attribute value.

Tekla.Structures.ModelInternal.ComponentWrapper.GetIntAttribute(System.String)
Gets the int attribute value for the specified attribute name.
attributeName: The attribute name.
Returns: The int attribute value.